## sso_proxy
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                     NAME                     |
|----------|----------------------------------------------|
| update   | `aws_ecs_service.pomerium_sso_proxy`         |
| recreate | `aws_ecs_task_definition.pomerium_sso_proxy` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.pomerium_sso_proxy will be updated in-place
  ~ resource "aws_ecs_service" "pomerium_sso_proxy" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/sso_proxy/pomerium_sso_proxy"
        name                               = "pomerium_sso_proxy"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy:130" -> (known after apply)
        # (15 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.pomerium_sso_proxy must be replaced
-/+ resource "aws_ecs_task_definition" "pomerium_sso_proxy" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy:130" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  ~ environment      = [
                        # (6 unchanged elements hidden)
                        {
                            name  = "LOG_LEVEL"
                            value = "debug"
                        },
                      ~ {
                            name  = "ROUTES"
                          ~ value = "LSBmcm9tOiBodHRwczovL2F1dGguc2VjdXJpdHkuY2Rzc2FuZGJveC54eXoKICB0bzogaHR0cDovL2F1dGguNzk0NzIyMzY1ODA5LmxvY2FsOjgwMDAKICBwb2xpY3k6CiAgICAtIGFsbG93OgogICAgICAgIG9yOgogICAgICAgICAgLSBkb21haW46CiAgICAgICAgICAgICAgaXM6IHNlY3VyaXR5LmNkc3NhbmRib3gueHl6CiAgY29yc19hbGxvd19wcmVmbGlnaHQ6IHRydWUKICB0aW1lb3V0OiAzMHMKCi0gZnJvbTogaHR0cHM6Ly9jc3AtcmVwb3J0cy5zZWN1cml0eS5jZHNzYW5kYm94Lnh5egogIHRvOiBodHRwOi8vaW50ZXJuYWwtY3NwLXJlcG9ydHMtNjIxMDU2NDcuY2EtY2VudHJhbC0xLmVsYi5hbWF6b25hd3MuY29tOjgwMDAKICBwcmVzZXJ2ZV9ob3N0X2hlYWRlcjogdHJ1ZQogIHBvbGljeToKICAgICAgLSBhbGxvdzoKICAgICAgICAgIG9yOgogICAgICAgICAgICAtIGRvbWFpbjoKICAgICAgICAgICAgICAgIGlzOiBjZHMtc25jLmNhCgotIGZyb206IGh0dHBzOi8vY3NwLXJlcG9ydC10by5zZWN1cml0eS5jZHNzYW5kYm94Lnh5egogIHRvOiBodHRwOi8vaW50ZXJuYWwtY3NwLXJlcG9ydHMtNjIxMDU2NDcuY2EtY2VudHJhbC0xLmVsYi5hbWF6b25hd3MuY29tOjgwMDAKICBwcmVzZXJ2ZV9ob3N0X2hlYWRlcjogdHJ1ZQogIGNvcnNfYWxsb3dfcHJlZmxpZ2h0OiB0cnVlCiAgcG9saWN5OgogICAgICAtIGFsbG93OgogICAgICAgICAgb3I6CiAgICAgICAgICAgIC0gaHR0cF9tZXRob2Q6CiAgICAgICAgICAgICAgICBpczogUE9TVAogICAgICAgICAgICAtIGh0dHBfbWV0aG9kOgogICAgICAgICAgICAgICAgaXM6IFBVVAogICAgICAgICAgYW5kOgogICAgICAgICAgICAtIGh0dHBfcGF0aDoKICAgICAgICAgICAgICAgIGlzOiAvcmVwb3J0" -> "LSBmcm9tOiBodHRwczovL2F1dGguc2VjdXJpdHkuY2Rzc2FuZGJveC54eXoKICB0bzogaHR0cDovL2F1dGguNzk0NzIyMzY1ODA5LmxvY2FsOjgwMDAKICBwb2xpY3k6CiAgICAtIGFsbG93OgogICAgICAgIG9yOgogICAgICAgICAgLSBkb21haW46CiAgICAgICAgICAgICAgaXM6IHNlY3VyaXR5LmNkc3NhbmRib3gueHl6CiAgY29yc19hbGxvd19wcmVmbGlnaHQ6IHRydWUKICB0aW1lb3V0OiAzMHMKCi0gZnJvbTogaHR0cHM6Ly9jc3AtcmVwb3J0LXRvLnNlY3VyaXR5LmNkc3NhbmRib3gueHl6CiAgdG86IGh0dHBzOi8vMTIzNDU2Nzg5MC5sYW1iZGEtdXJsLmNhLWNlbnRyYWwtMS5vbi5hd3MKICBwcmVzZXJ2ZV9ob3N0X2hlYWRlcjogdHJ1ZQogIGNvcnNfYWxsb3dfcHJlZmxpZ2h0OiB0cnVlCiAgcG9saWN5OgogICAgICAtIGFsbG93OgogICAgICAgICAgb3I6CiAgICAgICAgICAgIC0gaHR0cF9tZXRob2Q6CiAgICAgICAgICAgICAgICBpczogUE9TVAogICAgICAgICAgICAtIGh0dHBfbWV0aG9kOgogICAgICAgICAgICAgICAgaXM6IFBVVAogICAgICAgICAgYW5kOgogICAgICAgICAgICAtIGh0dHBfcGF0aDoKICAgICAgICAgICAgICAgIGlzOiAvcmVwb3J0"
                        },
                    ]
                  - mountPoints      = [] -> null
                    name             = "pomerium_sso_proxy"
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "pomerium_sso_proxy" -> (known after apply)
      ~ revision                 = 130 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
